PLANT_LIST = ["L1","L2","L3","L4","L5","L6","L7"]
OFFLINE_PLANT_LIST = ["LX1","LX2"]

JISSUI_LIST = ["基本予算","0実12推","1実11推","2実10推","3実9推",
                "4実8推","5実7推","6実6推","7実5推","8実4推",
                "9実3推","10実2推","11実1推"]

ALL_MONTH_LIST = ["4月","5月","6月","7月","8月","9月",
                  "10月","11月","12月","1月","2月","3月"]

KAMIKI_MONTH_LIST = ["4月","5月","6月","7月","8月","9月"]
SHIMOKI_MONTH_LIST = ["10月","11月","12月","1月","2月","3月"]


SHEET_LIST = ["合計販売量","幅","cs",
                "確定生産量","確定販売量","最低連続生産時間",
                "期首在庫","生産回数","基準在庫月数Min","基準在庫月数Max",
                "標準FC単価","標準VC単価","レア品種","サブ品種","優先SVA品種",
                "生産能力（新）","生産量達成率（新）","保全計画（新）","メインドープ・メイン品種（新）","抱き合わせ保全（新）",
                "工場品種対応表","工場ドープ対応表","ドープグループ"]

SWITCH_SHEET_LIST = ["L1月中切替","L2月中切替","L3月中切替","L4月中切替","L5月中切替","【上期】L6月中切替","【下期】L6月中切替","L7月中切替",
                    "L1月間切替（生産品種のみ）","L2月間切替（生産品種のみ）","L3月間切替（生産品種のみ）","L4月間切替（生産品種のみ）",
                    "L5月間切替（生産品種のみ）","【上期】L6月間切替（生産品種のみ）","【下期】L6月間切替（生産品種のみ）","L7月間切替（生産品種のみ）",
                    "L1月間切替（保全前期）","L2月間切替（保全前期）","L3月間切替（保全前期）","L4月間切替（保全前期）",
                    "L5月間切替（保全前期）","【上期】L6月間切替（保全前期）","【下期】L6月間切替（保全前期）","L7月間切替（保全前期）",
                    "L1月間切替（保全後期）","L2月間切替（保全後期）","L3月間切替（保全後期）","L4月間切替（保全後期）",
                    "L5月間切替（保全後期）","【上期】L6月間切替（保全後期）","【下期】L6月間切替（保全後期）","L7月間切替（保全後期）"
                    ]
